'''
问答分类ID快速匹配分类名称脚本
'''

mCates = [0,0,"家装设计","装修流程","家居产品","装饰材料","公装设计","房产知识","技术专区"]

sCates = [
    [],
    [],
    ["装修风水","装修风格","客厅","玄关","过道","卧室","书房","餐厅","厨房","阳台","花园","卫生间","儿童房","衣帽间","别墅","小户型","二手房装修","复式","样板间","装饰柜","其他","不限"],
    ["新房验收","收费咨询","装修预算","装修合同","施工工艺","业主维权","环保检测","装修公司","完工验收","水电改造","维护保养","其它","不限"],
    ["家具","卫浴设备","灯具/照明","儿童家具/用品","家用电器","橱柜","厨卫电器","厨房用具","地毯","饰品","庭院/花园","暖气设备","家庭影院","壁炉/火炉","天花板/吊顶","床上用品","窗帘/配件","日杂用品","其他","家居生活","婚嫁","不限"],
    ["夹板木材","地板","涂料/油漆","瓷砖/石材","门窗","五金","壁纸","水龙头","建筑构件","管材管件","其他","不限"],
    ["办公楼","商场","专卖店","酒店宾馆/客房","餐饮酒吧","歌舞迪厅","休闲健身","体育场馆","会展剧场","博物馆","图书馆","学校","医院","机场车船站","工厂","公园广场","会所","园林","其他","不限"],
    ["购房资格","购房税费","委托担保","交易流程","产权产证","购房首付","贷款利率","贷款流程","贷款类型","公积金","商品房","限价房","经适保障房","民房土地","房产政策","合同协议","房屋性质","其他","不限"],
    ["3DMAX","VR","LS","AutoCAD","Photoshop","电脑网络问题","模型材质","培训认证","手机问题","不限"]
    ]
    
def get_cate_by_id(pid,id):
    return '%s %s' %(mCates[int(pid)],sCates[int(pid)][int(id)])
